import List.List;

import java.util.Scanner;

/*

Написати програму на java для роботи з однозв'язним списком.
Реалізувати такі операції над списком:
	додавання елементу в середину списку таким чином, щоб список завжди був упорядкований за зростанням значень інформаційної частини (операцію сортування не застосовувати);
	видалення елементу з середини списку за ключем;
	виведення списку на екран.
При додаванні елементу його значення задається користувачем з клавіатури.
Список реалізувати у вигляді двох класів: список та елемент списку. Класи мають містити конструктори.
Інформаційна частина списку – ціле число.
Реалізувати клас Main, у якому прописати інтерфейс користувача з текстовим меню для роботи зі списком. Меню передбачає виконання вказаних операцій та можливість виходу з програми. Меню реалізувати за допомогою циклу з пост умовою.


 */  

public class Algor1210 {
    public static void main(String[] args) {

        Scanner scaner = new Scanner(System.in);
        int choice;
        int value = 0;
        List list = new List();

        Scanner scanner = new Scanner(System.in);
        do {
            //текстовим меню для роботи зі списком
            //Меню передбачає виконання вказаних операцій та можливість виходу з програми.
            //Меню реалізувати за допомогою циклу з пост умовою.

            System.out.println("1. Добавить в начало списка\n" +
                    "2. Добавить в середину списка\n" +
                    "3. Удалить элемент из середины списка\n" +
                    "4. Вывести массив на экран\n" +
                    "5. Выход из программы\n" +
                    " >>  ");

            choice = scaner.nextInt();
            if (choice < 4){
                //При додаванні елементу його значення задається користувачем з клавіатури
                System.out.println("Input number\n >>  ");
                value = scaner.nextInt();
            }
            switch (choice) {
                case 1:
                    // "1. Добавить в начало списка\n" +
                    list.addFist(value);
                    break;
                case 2:
                    // "2. Добавление в середину\n"
                    list.addMidle(value);
                    break;
                case 3:
                    //"3. Удалить элемент из середины списка"
                    list.delMidle(value);
                case 4:
                    // "4. Вывести массив на экран\n"
                    list.show();
                    break;
                case 5:
                    // "5. Выход из программы\n"
                    break;
                default:
                    break;
            }
        }while(choice != 5);


    }
}
