import List.List;

import java.util.Scanner;

/*
Написати програму на java для роботи з однозв'язним списком.
Реалізувати такі операції над списком:
	додавання елементу в початок;
	видалення елементу з початку;
	виведення списку на екран.
При додаванні елементу його значення задається користувачем з клавіатури.
Список реалізувати у вигляді двох класів: список та елемент списку. Класи мають містити конструктори.
Інформаційна частина списку – ціле число.
Реалізувати клас Main, у якому прописати інтерфейс користувача з текстовим меню для роботи зі списком. Меню передбачає виконання вказаних операцій та можливість виходу з програми. Меню реалізувати за допомогою циклу з пост умовою.

 */

public class Algor1210 {
    public static void main(String[] args) {

        Scanner scaner = new Scanner(System.in);
        int choice;
        int value = 0;
        List list = new List();

        Scanner scanner = new Scanner(System.in);
        do {
            //текстовим меню для роботи зі списком
            //Меню передбачає виконання вказаних операцій та можливість виходу з програми.
            //Меню реалізувати за допомогою циклу з пост умовою.

            System.out.println("1. Добавить в начало списка\n" +
                    "2. Удалить элемент из начала списка\n" +
                    "3. Вывести массив на экран\n" +
                    "4. Выход из программы\n" +
                    " >>  ");

            choice = scaner.nextInt();
            if (choice == 1){
                //При додаванні елементу його значення задається користувачем з клавіатури
                System.out.println("Input number\n >>  ");
                value = scaner.nextInt();
            }
            switch (choice) {
                case 1:
                    // "1. Добавить в начало списка\n" +
                    list.addFist(value);
                    break;
                case 2:
                    //"2. Удалить элемент из начала списка"
                    list.delFirst();
                case 3:
                    // "3. Вывести массив на экран\n"
                    list.show();
                    break;
                case 4:
                    // "4. Выход из программы\n"
                    break;
                default:
                    break;
            }
        }while(choice != 4);


    }
}
